Documents/ОбучениеРазвитиеСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ОбучениеРазвитиеСотрудников</Name>
			<BasedOn>
				<xr:Item>Document.ОбучениеРазвитиеСотрудников</xr:Item>
				<xr:Item>Document.ЗаявкаНаОбучениеРазвитие</xr:Item>
				<xr:Item>Document.ПубликацияМероприятияОбученияРазвития</xr:Item>
				<xr:Item>Catalog.МероприятияОбученияРазвития</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ОбучениеСотрудников</xr:Item>
				<xr:Item>InformationRegister.ФинансовыйУчетОбучениеСотрудников</xr:Item>
				<xr:Item>InformationRegister.ЭлектронныеКурсыСотрудников</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Мероприятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МероприятияОбученияРазвития</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Преподаватель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоПроведения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаРасходов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтоимостьМероприятия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОпределенияСтоимости</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыРасчетаСуммыРасходовНаПерсонал</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоУчебныхЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаОбучениеРазвитие</v8:Type>
						<v8:Type>cfg:DocumentRef.ПубликацияМероприятияОбученияРазвития</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПервичныйЭтапОбучения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОбучениеРазвитиеСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНаСотрудника</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Оценка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОценкиОбучения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КомментарийКОценке</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособОтражения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СпособыОтраженияВФинансовомУчете</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Расходы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФизическиеЛица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УдалитьКомпетенции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Компетенция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КомпетенцииПерсонала</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ОткликиНаПубликациюМероприятияОбученияРазвития.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ОткликиНаПубликациюМероприятияОбученияРазвития</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Отклик</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыОткликовСотрудников</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьОтказался</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Публикация</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПубликацияМероприятияОбученияРазвития</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЭлектронныеКурсыСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ЭлектронныеКурсыСотрудников</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДоступенДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭлектронныйКурс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭлектронныеКурсы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВариантыОткликовСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВариантыОткликовСотрудников</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Согласие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отказ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозможноеСогласие</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СостоянияСогласования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СостоянияСогласования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отклонено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Рассматривается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласовано</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ОбучениеРазвитиеСотрудников/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	ДанныеДляПроведения = Документы.ОбучениеРазвитиеСотрудников.ПолучитьДанныеДляПроведения(Ссылка);
	
	ОбучениеРазвитие.СформироватьДвиженияОбучения(Движения, ДанныеДляПроведения.ДвиженияОбучения);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ФинансовыйУчет") Тогда
		МодульФинансовыйУчет = ОбщегоНазначения.ОбщийМодуль("ФинансовыйУчет");
		МодульФинансовыйУчет.СформироватьДвиженияОбученияРазвитияСотрудников(Движения, ДанныеДляПроведения);
	КонецЕсли;
	
	ЗарегистрироватьЭлектронныеКурсы(Движения, ДанныеДляПроведения.ЭлектронныеКурсы);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ЗаполнитьПоДокументуПубликацияМероприятияОбученияРазвития(ДанныеЗаполнения);
	ЗаполнитьПоЗаявкеНаОбучение(ДанныеЗаполнения);
	ЗаполнитьПоДаннымДругогоОбучения(ДанныеЗаполнения);
	ЗаполнитьПоМероприятиюОбучения(ДанныеЗаполнения);
	ЗаполнитьПоДаннымЗаполнения(ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	// Заполнение реквизита ПервичныйЭтапОбучения.
	Если Не ЗначениеЗаполнено(ПервичныйЭтапОбучения) Тогда
		Если Не ЗначениеЗаполнено(Ссылка) Тогда
			УстановитьСсылкуНового(Документы.ОбучениеРазвитиеСотрудников.ПолучитьСсылку());
			ПервичныйЭтапОбучения = ПолучитьСсылкуНового();
		Иначе
			ПервичныйЭтапОбучения = Ссылка;
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьСуммуРасходов();
	
	РаспределитьСуммуРасходовПоСотрудникам();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ЗарплатаКадры.ПроверитьКорректностьДаты(Ссылка, ДатаНачала, "Объект.ДатаНачала", Отказ, НСтр("ru = 'Начало периода обучения'"), , , Ложь);
	
	МассивНепроверяемыхРеквизитов = Новый Массив();
	
	Если ЗначениеЗаполнено(ДатаОкончания) И ДатаНачала > ДатаОкончания Тогда
		ТекстСообщения = НСтр("ru = 'Неверно заполнен период обучения. Выбранная дата начала позже даты окончания.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка, "ДатаНачала", , Отказ);
		МассивНепроверяемыхРеквизитов.Добавить("ДатаНачала");
	КонецЕсли;
	
	ОбучениеРазвитие.ПроверитьТабличнуюЧастьСотрудниковНаДублиФизическихЛиц(ЭтотОбъект, Отказ);
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты,МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьОткликнувшимися(Публикация)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ОбучениеРазвитиеСотрудниковСотрудники.Сотрудник.ФизическоеЛицо КАК ФизическоеЛицо
		|ПОМЕСТИТЬ УжеПодобранныеСотрудники
		|ИЗ
		|	Документ.ОбучениеРазвитиеСотрудников.Сотрудники КАК ОбучениеРазвитиеСотрудниковСотрудники
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОбучениеРазвитиеСотрудников КАК ОбучениеРазвитиеСотрудников
		|		ПО ОбучениеРазвитиеСотрудниковСотрудники.Ссылка = ОбучениеРазвитиеСотрудников.Ссылка
		|ГДЕ
		|	ОбучениеРазвитиеСотрудников.Основание = &Публикация
		|	И ОбучениеРазвитиеСотрудниковСотрудники.Ссылка <> &Ссылка
		|	И ОбучениеРазвитиеСотрудников.Проведен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОткликиНаПубликациюМероприятияОбученияРазвития.ФизическоеЛицо КАК ФизическоеЛицо
		|ПОМЕСТИТЬ Отклики
		|ИЗ
		|	РегистрСведений.ОткликиНаПубликациюМероприятияОбученияРазвития КАК ОткликиНаПубликациюМероприятияОбученияРазвития
		|ГДЕ
		|	ОткликиНаПубликациюМероприятияОбученияРазвития.Публикация = &Публикация
		|	И (ОткликиНаПубликациюМероприятияОбученияРазвития.Отклик = &Согласие
		|			ИЛИ ОткликиНаПубликациюМероприятияОбученияРазвития.Отклик = &ВозможноеСогласие)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Отклики.ФизическоеЛицо КАК ФизическоеЛицо
		|ИЗ
		|	Отклики КАК Отклики
		|		ЛЕВОЕ СОЕДИНЕНИЕ УжеПодобранныеСотрудники КАК УжеПодобранныеСотрудники
		|		ПО Отклики.ФизическоеЛицо = УжеПодобранныеСотрудники.ФизическоеЛицо
		|ГДЕ
		|	УжеПодобранныеСотрудники.ФизическоеЛицо ЕСТЬ NULL ";
	
	Запрос.УстановитьПараметр("Согласие", ПредопределенноеЗначение("Перечисление.ВариантыОткликовСотрудников.Согласие"));
	Запрос.УстановитьПараметр("ВозможноеСогласие", ПредопределенноеЗначение("Перечисление.ВариантыОткликовСотрудников.ВозможноеСогласие"));
	Запрос.УстановитьПараметр("Публикация", Публикация);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	СписокФизическихЛиц = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ФизическоеЛицо");
	
	ПараметрыСотрудников = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
	ПараметрыСотрудников.СписокФизическихЛиц = СписокФизическихЛиц;
	
	СписокСотрудников = КадровыйУчет.СотрудникиОрганизации(Истина,ПараметрыСотрудников);
	Сотрудники.Загрузить(УдалитьСовместителей(СписокСотрудников));

КонецПроцедуры

// Удаляет лишних сотрудников из таблицы значений, в случае если в выборке попался совместитель
//  и сделал несколько строк с сотрудниками для одного физического лица.
Функция УдалитьСовместителей(СписокСотрудников)

	МассивУдаляемыхСтрок = Новый Массив();
	СписокФизическихЛиц = Новый СписокЗначений;
	
	Для Каждого Сотрудник Из СписокСотрудников Цикл
		Если СписокФизическихЛиц.НайтиПоЗначению(Сотрудник.ФизическоеЛицо) = Неопределено Тогда
			СписокФизическихЛиц.Добавить(Сотрудник.ФизическоеЛицо);
		Иначе
			МассивУдаляемыхСтрок.Добавить(Сотрудник);
		КонецЕсли;
	КонецЦикла; 
	
	Для Каждого УдаляемаяСтрока Из МассивУдаляемыхСтрок Цикл
		СписокСотрудников.Удалить(УдаляемаяСтрока);
	КонецЦикла; 
	
	Возврат СписокСотрудников;

КонецФункции

Процедура ЗарегистрироватьЭлектронныеКурсы(Движения, ЭлектронныеКурсы)
	
	Для Каждого Строка Из ЭлектронныеКурсы Цикл
		НоваяСтрока = Движения.ЭлектронныеКурсыСотрудников.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		Движения.ЭлектронныеКурсыСотрудников.Записывать = Истина;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьПоДокументуПубликацияМероприятияОбученияРазвития(ДанныеЗаполнения)
	
	Если ТипЗнч(ДанныеЗаполнения) <> Тип("ДокументСсылка.ПубликацияМероприятияОбученияРазвития") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		Возврат;
	КонецЕсли;
	
	Основание = ДанныеЗаполнения;
	ДанныеОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Основание, "Мероприятие, ДатаНачалаСобытия");
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеОснования);
	ДатаНачала = ДанныеОснования.ДатаНачалаСобытия;
	
	// Заполнение табличной части "Сотрудники" откликнувшимися на публикацию
	// но не подобранными в другие документы.
	ЗаполнитьОткликнувшимися(Основание);
	
	ЗаполнитьПоМероприятиюОбучения(ДанныеОснования.Мероприятие);
	
КонецПроцедуры

Процедура ЗаполнитьПоДаннымЗаполнения(ДанныеЗаполнения)
	
	Если ТипЗнч(ДанныеЗаполнения) <> Тип("Структура") Тогда // Заполнение по данным плана.
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	
	Сотрудники.Очистить();
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицуИзМассива(Сотрудники, 
		ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеЗаполнения, "Сотрудники", Новый Массив), "Сотрудник");
	
	Если ДанныеЗаполнения.Свойство("Мероприятие") Тогда
		ЗаполнитьПоМероприятиюОбучения(ДанныеЗаполнения.Мероприятие);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПоМероприятиюОбучения(МероприятиеСсылка)
	
	Если ТипЗнч(МероприятиеСсылка) <> Тип("СправочникСсылка.МероприятияОбученияРазвития") Тогда
		Возврат;
	КонецЕсли;

	КоличествоУчебныхЧасов = Неопределено;
	Преподаватель = Неопределено;
	Контрагент = Неопределено;
	МестоПроведения = Неопределено;
	СтоимостьМероприятия = Неопределено;
	СпособОпределенияСтоимости = Неопределено;
	
	Мероприятие = МероприятиеСсылка;
	Если ЗначениеЗаполнено(Мероприятие) Тогда
		ИменаРеквизитов = Новый Массив;
		ИменаРеквизитов.Добавить("КоличествоУчебныхЧасов"); 
		ИменаРеквизитов.Добавить("Преподаватель");
		ИменаРеквизитов.Добавить("Контрагент");
		ИменаРеквизитов.Добавить("МестоПроведения");
		ИменаРеквизитов.Добавить("Стоимость");
		ИменаРеквизитов.Добавить("СпособОпределенияСтоимости");
		ДанныеМероприятия = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(МероприятиеСсылка, ИменаРеквизитов);
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеМероприятия);
		СтоимостьМероприятия = ДанныеМероприятия.Стоимость;
	КонецЕсли;
	
	ЗаполнитьСуммуРасходов();
	
КонецПроцедуры

Процедура ЗаполнитьПоДаннымДругогоОбучения(ОбучениеСсылка)
	
	Если ТипЗнч(ОбучениеСсылка) <> Тип("ДокументСсылка.ОбучениеРазвитиеСотрудников") Тогда // продолжение поэтапного обучения
		Возврат;
	КонецЕсли;
	
	ПервичныйЭтапОбучения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбучениеСсылка, "ПервичныйЭтапОбучения");
	Если Не ЗначениеЗаполнено(ПервичныйЭтапОбучения) Тогда
		ПервичныйЭтапОбучения = ОбучениеСсылка;
	КонецЕсли;
	
	ИменаРеквизитов = "Подразделение, Мероприятие, Преподаватель, Контрагент, МестоПроведения";
	ДанныеОбучения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ОбучениеСсылка, ИменаРеквизитов);
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеОбучения, ИменаРеквизитов);
	
	Сотрудники.Загрузить(Документы.ОбучениеРазвитиеСотрудников.СотрудникиОбучения(ОбучениеСсылка));
	
	ЗаполнитьПоМероприятиюОбучения(ДанныеОбучения.Мероприятие);
	
КонецПроцедуры

Процедура ЗаполнитьПоЗаявкеНаОбучение(ЗаявкаСсылка)

	Если ТипЗнч(ЗаявкаСсылка) <> Тип("ДокументСсылка.ЗаявкаНаОбучениеРазвитие") Тогда
		Возврат;
	КонецЕсли;

	ДанныеЗаявки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		ЗаявкаСсылка,
		"Статус, Подразделение, Мероприятие, ДатаНачала, ДатаОкончания, СуммаРасходов");
	
	Если ДанныеЗаявки.Статус <> Перечисления.СостоянияСогласования.Согласовано Тогда
		ВызватьИсключение НСтр("ru = 'Обучение может вводиться только на основании утвержденных заявок.'");
	КонецЕсли;
	
	Основание = ЗаявкаСсылка;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаявки, "Подразделение, ДатаНачала, ДатаОкончания, СуммаРасходов");
	
	// Заполнение табличной части "Сотрудники".
	Сотрудники.Очистить();
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицуИзМассива(Сотрудники, 
		Документы.ЗаявкаНаОбучениеРазвитие.СотрудникиЗаявки(ЗаявкаСсылка), "Сотрудник");

	ЗаполнитьПоМероприятиюОбучения(ДанныеЗаявки.Мероприятие);

КонецПроцедуры

Процедура ЗаполнитьСуммуРасходов()
	СуммаРасходов = ОбучениеРазвитиеКлиентСервер.СуммаРасходовНаОбучение(
		ОбучениеРазвитиеКлиентСервер.СтоимостьМероприятия(СтоимостьМероприятия, СпособОпределенияСтоимости, Сотрудники.Количество()), 
		Расходы);
КонецПроцедуры

Процедура РаспределитьСуммуРасходовПоСотрудникам()

	Если Сотрудники.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если СуммаРасходов = 0 Тогда
		Сотрудники.ЗагрузитьКолонку(Новый Массив(Сотрудники.Количество()), "СуммаНаСотрудника");
		Возврат;
	КонецЕсли;
	
	Таблица = Сотрудники.Выгрузить(, "НомерСтроки");
	Таблица.ЗаполнитьЗначения(1);
	
	СуммыРасходов = ОбщегоНазначенияКлиентСервер.РаспределитьСуммуПропорциональноКоэффициентам(
		СуммаРасходов, Таблица.ВыгрузитьКолонку("НомерСтроки"));

	Индекс = 0;
	Для Каждого Сотрудник Из Сотрудники Цикл
		Сотрудник.СуммаНаСотрудника = СуммыРасходов[Индекс];
		Индекс = Индекс + 1;
	КонецЦикла; 

КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
